6) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     use RefreshDatabase;
     #[Test]
-    public function login_screen_can_be_rendered(): void
+    protected function login_screen_can_be_rendered(): void
     {
         $response = $this->get(route('login'));
         $response->assertStatus(200);

7) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:20    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function login_screen_can_be_rendered(): void
     {
         $response = $this->get(route('login'));
-        $response->assertStatus(200);
+        $response->assertStatus(199);
     }
     #[Test]
     public function users_can_authenticate_using_the_login_screen(): void

8) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:20    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function login_screen_can_be_rendered(): void
     {
         $response = $this->get(route('login'));
-        $response->assertStatus(200);
+        $response->assertStatus(201);
     }
     #[Test]
     public function users_can_authenticate_using_the_login_screen(): void

9) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function login_screen_can_be_rendered(): void
     {
         $response = $this->get(route('login'));
-        $response->assertStatus(200);
+        
     }
     #[Test]
     public function users_can_authenticate_using_the_login_screen(): void

10) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:23    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertStatus(200);
     }
     #[Test]
-    public function users_can_authenticate_using_the_login_screen(): void
+    protected function users_can_authenticate_using_the_login_screen(): void
     {
         $user = User::factory()->create();
         $response = $this->post(route('login.store'), ['email' => $user->email, 'password' => 'password']);

11) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function users_can_authenticate_using_the_login_screen(): void
     {
         $user = User::factory()->create();
-        $response = $this->post(route('login.store'), ['email' => $user->email, 'password' => 'password']);
+        $response = $this->post(route('login.store'), ['password' => 'password']);
         $this->assertAuthenticated();
         $response->assertRedirect(RouteServiceProvider::HOME);
     }

12) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:29    [M] ArrayItem

--- Original
+++ New
@@ @@
     public function users_can_authenticate_using_the_login_screen(): void
     {
         $user = User::factory()->create();
-        $response = $this->post(route('login.store'), ['email' => $user->email, 'password' => 'password']);
+        $response = $this->post(route('login.store'), ['email' > $user->email, 'password' => 'password']);
         $this->assertAuthenticated();
         $response->assertRedirect(RouteServiceProvider::HOME);
     }

13) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->post(route('login.store'), ['email' => $user->email, 'password' => 'password']);
-        $this->assertAuthenticated();
+        
         $response->assertRedirect(RouteServiceProvider::HOME);
     }
     #[Test]

14) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $response = $this->post(route('login.store'), ['email' => $user->email, 'password' => 'password']);
         $this->assertAuthenticated();
-        $response->assertRedirect(RouteServiceProvider::HOME);
+        
     }
     #[Test]
     public function users_can_not_authenticate_with_invalid_password(): void

15) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertRedirect(RouteServiceProvider::HOME);
     }
     #[Test]
-    public function users_can_not_authenticate_with_invalid_password(): void
+    protected function users_can_not_authenticate_with_invalid_password(): void
     {
         $user = User::factory()->create();
         $this->post(route('login.store'), ['email' => $user->email, 'password' => 'wrong-password']);

16) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:43    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function users_can_not_authenticate_with_invalid_password(): void
     {
         $user = User::factory()->create();
-        $this->post(route('login.store'), ['email' => $user->email, 'password' => 'wrong-password']);
+        $this->post(route('login.store'), ['password' => 'wrong-password']);
         $this->assertGuest();
     }
     #[Test]

17) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function users_can_not_authenticate_with_invalid_password(): void
     {
         $user = User::factory()->create();
-        $this->post(route('login.store'), ['email' => $user->email, 'password' => 'wrong-password']);
+        
         $this->assertGuest();
     }
     #[Test]

18) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:44    [M] ArrayItem

--- Original
+++ New
@@ @@
     public function users_can_not_authenticate_with_invalid_password(): void
     {
         $user = User::factory()->create();
-        $this->post(route('login.store'), ['email' => $user->email, 'password' => 'wrong-password']);
+        $this->post(route('login.store'), ['email' > $user->email, 'password' => 'wrong-password']);
         $this->assertGuest();
     }
     #[Test]

19) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $this->post(route('login.store'), ['email' => $user->email, 'password' => 'wrong-password']);
-        $this->assertGuest();
+        
     }
     #[Test]
     public function users_can_logout(): void

20) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->assertGuest();
     }
     #[Test]
-    public function users_can_logout(): void
+    protected function users_can_logout(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->post(route('logout.destroy'));

21) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->post(route('logout.destroy'));
-        $this->assertGuest();
+        
         $response->assertRedirect(route('welcome'));
     }
 }

22) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/AuthenticationTest.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $response = $this->actingAs($user)->post(route('logout.destroy'));
         $this->assertGuest();
-        $response->assertRedirect(route('welcome'));
+        
     }
 }

23) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     use RefreshDatabase;
     #[Test]
-    public function email_verification_screen_can_be_rendered(): void
+    protected function email_verification_screen_can_be_rendered(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         $response = $this->actingAs($user)->get(route('verify_email.notice'));

24) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:21    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     #[Test]
     public function email_verification_screen_can_be_rendered(): void
     {
-        $user = User::factory()->create(['email_verified_at' => null]);
+        $user = User::factory()->create([]);
         $response = $this->actingAs($user)->get(route('verify_email.notice'));
         $response->assertStatus(200);
     }

25) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:28    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         $response = $this->actingAs($user)->get(route('verify_email.notice'));
-        $response->assertStatus(200);
+        $response->assertStatus(199);
     }
     #[Test]
     public function email_can_be_verified(): void

26) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:28    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         $response = $this->actingAs($user)->get(route('verify_email.notice'));
-        $response->assertStatus(200);
+        $response->assertStatus(201);
     }
     #[Test]
     public function email_can_be_verified(): void

27) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         $response = $this->actingAs($user)->get(route('verify_email.notice'));
-        $response->assertStatus(200);
+        
     }
     #[Test]
     public function email_can_be_verified(): void

28) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertStatus(200);
     }
     #[Test]
-    public function email_can_be_verified(): void
+    protected function email_can_be_verified(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         Event::fake();

30) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function email_can_be_verified(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
-        Event::fake();
+        
         $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1($user->email)]);
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);

31) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:42    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         Event::fake();
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1($user->email)]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(59), ['id' => $user->id, 'hash' => sha1($user->email)]);
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());

32) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:42    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         Event::fake();
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1($user->email)]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(61), ['id' => $user->id, 'hash' => sha1($user->email)]);
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());

33) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:43    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         Event::fake();
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1($user->email)]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['hash' => sha1($user->email)]);
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());

34) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:44    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         Event::fake();
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1($user->email)]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' > $user->id, 'hash' => sha1($user->email)]);
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());

35) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:45    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         Event::fake();
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1($user->email)]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' > sha1($user->email)]);
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());

36) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Event::fake();
         $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1($user->email)]);
         $response = $this->actingAs($user)->get($verificationUrl);
-        Event::assertDispatched(Verified::class);
+        
         $this->assertTrue($user->fresh()->hasVerifiedEmail());
         $response->assertRedirect(RouteServiceProvider::HOME . '?verified=1');
     }

37) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1($user->email)]);
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
-        $this->assertTrue($user->fresh()->hasVerifiedEmail());
+        
         $response->assertRedirect(RouteServiceProvider::HOME . '?verified=1');
     }
     #[Test]

38) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:59    [M] Concat

--- Original
+++ New
@@ @@
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());
-        $response->assertRedirect(RouteServiceProvider::HOME . '?verified=1');
+        $response->assertRedirect('?verified=1' . RouteServiceProvider::HOME);
     }
     #[Test]
     public function email_is_not_verified_with_invalid_hash(): void

39) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:59    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());
-        $response->assertRedirect(RouteServiceProvider::HOME . '?verified=1');
+        $response->assertRedirect('?verified=1');
     }
     #[Test]
     public function email_is_not_verified_with_invalid_hash(): void

40) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:59    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());
-        $response->assertRedirect(RouteServiceProvider::HOME . '?verified=1');
+        $response->assertRedirect(RouteServiceProvider::HOME);
     }
     #[Test]
     public function email_is_not_verified_with_invalid_hash(): void

41) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $response = $this->actingAs($user)->get($verificationUrl);
         Event::assertDispatched(Verified::class);
         $this->assertTrue($user->fresh()->hasVerifiedEmail());
-        $response->assertRedirect(RouteServiceProvider::HOME . '?verified=1');
+        
     }
     #[Test]
     public function email_is_not_verified_with_invalid_hash(): void

42) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:62    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertRedirect(RouteServiceProvider::HOME . '?verified=1');
     }
     #[Test]
-    public function email_is_not_verified_with_invalid_hash(): void
+    protected function email_is_not_verified_with_invalid_hash(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1('wrong-email')]);

44) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:71    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function email_is_not_verified_with_invalid_hash(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(59), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
         $this->actingAs($user)->get($verificationUrl);
         $this->assertFalse($user->fresh()->hasVerifiedEmail());
     }
 }

45) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:71    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function email_is_not_verified_with_invalid_hash(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(61), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
         $this->actingAs($user)->get($verificationUrl);
         $this->assertFalse($user->fresh()->hasVerifiedEmail());
     }
 }

46) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:72    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function email_is_not_verified_with_invalid_hash(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['hash' => sha1('wrong-email')]);
         $this->actingAs($user)->get($verificationUrl);
         $this->assertFalse($user->fresh()->hasVerifiedEmail());
     }
 }

47) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:73    [M] ArrayItem

--- Original
+++ New
@@ @@
     public function email_is_not_verified_with_invalid_hash(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' > $user->id, 'hash' => sha1('wrong-email')]);
         $this->actingAs($user)->get($verificationUrl);
         $this->assertFalse($user->fresh()->hasVerifiedEmail());
     }
 }

48) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:74    [M] ArrayItem

--- Original
+++ New
@@ @@
     public function email_is_not_verified_with_invalid_hash(): void
     {
         $user = User::factory()->create(['email_verified_at' => null]);
-        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
+        $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' > sha1('wrong-email')]);
         $this->actingAs($user)->get($verificationUrl);
         $this->assertFalse($user->fresh()->hasVerifiedEmail());
     }
 }

49) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:78    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create(['email_verified_at' => null]);
         $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
-        $this->actingAs($user)->get($verificationUrl);
+        
         $this->assertFalse($user->fresh()->hasVerifiedEmail());
     }
 }

50) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/EmailVerificationTest.php:81    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create(['email_verified_at' => null]);
         $verificationUrl = URL::temporarySignedRoute('verify_email.verify', now()->addMinutes(60), ['id' => $user->id, 'hash' => sha1('wrong-email')]);
         $this->actingAs($user)->get($verificationUrl);
-        $this->assertFalse($user->fresh()->hasVerifiedEmail());
+        
     }
 }

51) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     use RefreshDatabase;
     #[Test]
-    public function confirm_password_screen_can_be_rendered(): void
+    protected function confirm_password_screen_can_be_rendered(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('confirm_password.show'));

52) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:22    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('confirm_password.show'));
-        $response->assertStatus(200);
+        $response->assertStatus(199);
     }
     #[Test]
     public function password_can_be_confirmed(): void

53) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:22    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('confirm_password.show'));
-        $response->assertStatus(200);
+        $response->assertStatus(201);
     }
     #[Test]
     public function password_can_be_confirmed(): void

54) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('confirm_password.show'));
-        $response->assertStatus(200);
+        
     }
     #[Test]
     public function password_can_be_confirmed(): void

55) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertStatus(200);
     }
     #[Test]
-    public function password_can_be_confirmed(): void
+    protected function password_can_be_confirmed(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->post(route('confirm_password.store'), ['password' => 'password']);

56) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:31    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function password_can_be_confirmed(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->post(route('confirm_password.store'), ['password' => 'password']);
+        $response = $this->actingAs($user)->post(route('confirm_password.store'), []);
         $response->assertRedirect();
         $response->assertSessionHasNoErrors();
     }

57) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->post(route('confirm_password.store'), ['password' => 'password']);
-        $response->assertRedirect();
+        
         $response->assertSessionHasNoErrors();
     }
     #[Test]

58) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $response = $this->actingAs($user)->post(route('confirm_password.store'), ['password' => 'password']);
         $response->assertRedirect();
-        $response->assertSessionHasNoErrors();
+        
     }
     #[Test]
     public function password_is_not_confirmed_with_invalid_password(): void

59) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertSessionHasNoErrors();
     }
     #[Test]
-    public function password_is_not_confirmed_with_invalid_password(): void
+    protected function password_is_not_confirmed_with_invalid_password(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->post(route('confirm_password.store'), ['password' => 'wrong-password']);

60) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function password_is_not_confirmed_with_invalid_password(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->post(route('confirm_password.store'), ['password' => 'wrong-password']);
+        $response = $this->actingAs($user)->post(route('confirm_password.store'), []);
         $response->assertSessionHasErrors();
     }
 }

61) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordConfirmationTest.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->post(route('confirm_password.store'), ['password' => 'wrong-password']);
-        $response->assertSessionHasErrors();
+        
     }
 }

62) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:16    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     use RefreshDatabase;
     #[Test]
-    public function reset_password_link_screen_can_be_rendered(): void
+    protected function reset_password_link_screen_can_be_rendered(): void
     {
         $response = $this->get(route('forgot_password.create'));
         $response->assertStatus(200);

63) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:21    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function reset_password_link_screen_can_be_rendered(): void
     {
         $response = $this->get(route('forgot_password.create'));
-        $response->assertStatus(200);
+        $response->assertStatus(199);
     }
     #[Test]
     public function reset_password_link_can_be_requested(): void
