111) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:22    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('dashboard'));
-        $response->assertStatus(200);
+        $response->assertStatus(199);
     }
 }

112) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:22    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('dashboard'));
-        $response->assertStatus(200);
+        $response->assertStatus(201);
     }
 }

113) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('dashboard'));
-        $response->assertStatus(200);
+        
     }
 }

138) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:17    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $user = new User();
         // Colunas esperadas
-        $columns_expected = ['name', 'email', 'password'];
+        $columns_expected = ['email', 'password'];
         // Verifica se as colunas esperadas não estão vazias
         $this->assertNotEmpty($columns_expected, 'O array de colunas esperadas não deve estar vazio.');
         // Colunas que o modelo User realmente aceita

139) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = new User();
         // Colunas esperadas
         $columns_expected = ['name', 'email', 'password'];
-        // Verifica se as colunas esperadas não estão vazias
-        $this->assertNotEmpty($columns_expected, 'O array de colunas esperadas não deve estar vazio.');
+        
         // Colunas que o modelo User realmente aceita
         $fillable_columns = $user->getFillable();
         // Verifica se todas as colunas esperadas estão presentes

140) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:31    [M] Foreach_

--- Original
+++ New
@@ @@
         // Colunas que o modelo User realmente aceita
         $fillable_columns = $user->getFillable();
         // Verifica se todas as colunas esperadas estão presentes
-        foreach ($columns_expected as $column) {
+        foreach ([] as $column) {
             $this->assertContains($column, $fillable_columns, "A coluna {$column} não está presente.");
         }
         // Verifica se não há colunas extras

141) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $fillable_columns = $user->getFillable();
         // Verifica se todas as colunas esperadas estão presentes
         foreach ($columns_expected as $column) {
-            $this->assertContains($column, $fillable_columns, "A coluna {$column} não está presente.");
+            
         }
         // Verifica se não há colunas extras
         $extra_columns = array_diff($fillable_columns, $columns_expected);

142) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:36    [M] UnwrapArrayDiff

--- Original
+++ New
@@ @@
             $this->assertContains($column, $fillable_columns, "A coluna {$column} não está presente.");
         }
         // Verifica se não há colunas extras
-        $extra_columns = array_diff($fillable_columns, $columns_expected);
+        $extra_columns = $fillable_columns;
         $this->assertCount(0, $extra_columns, 'Existem colunas extras no modelo.');
     }
     #[Test]

143) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:37    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         // Verifica se não há colunas extras
         $extra_columns = array_diff($fillable_columns, $columns_expected);
-        $this->assertCount(0, $extra_columns, 'Existem colunas extras no modelo.');
+        $this->assertCount(-1, $extra_columns, 'Existem colunas extras no modelo.');
     }
     #[Test]
     public function check_if_user_columns_are_not_empty(): void

144) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:37    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         // Verifica se não há colunas extras
         $extra_columns = array_diff($fillable_columns, $columns_expected);
-        $this->assertCount(0, $extra_columns, 'Existem colunas extras no modelo.');
+        $this->assertCount(1, $extra_columns, 'Existem colunas extras no modelo.');
     }
     #[Test]
     public function check_if_user_columns_are_not_empty(): void

145) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         // Verifica se não há colunas extras
         $extra_columns = array_diff($fillable_columns, $columns_expected);
-        $this->assertCount(0, $extra_columns, 'Existem colunas extras no modelo.');
+        
     }
     #[Test]
     public function check_if_user_columns_are_not_empty(): void

147) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = new User();
         $fillable_columns = $user->getFillable();
-        // Verifica se as colunas permitidas não estão vazias
-        $this->assertNotEmpty($fillable_columns, 'As colunas permitidas não devem estar vazias.');
+        
     }
     #[Test]
     public function check_if_user_columns_include_email_and_password(): void

149) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = new User();
         $fillable_columns = $user->getFillable();
-        // Verifica se as colunas incluem 'email' e 'password'
-        $this->assertContains('email', $fillable_columns, "A coluna 'email' não está presente.");
+        
         $this->assertContains('password', $fillable_columns, "A coluna 'password' não está presente.");
     }
 }

150) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $fillable_columns = $user->getFillable();
         // Verifica se as colunas incluem 'email' e 'password'
         $this->assertContains('email', $fillable_columns, "A coluna 'email' não está presente.");
-        $this->assertContains('password', $fillable_columns, "A coluna 'password' não está presente.");
+        
     }
 }
