1) /home/user/Documentos/Project/laravel-tests/tests/CreatesApplication.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /**
      * Creates the application.
      */
-    public function createApplication(): Application
+    protected function createApplication(): Application
     {
         $app = require __DIR__ . '/../bootstrap/app.php';
         $app->make(Kernel::class)->bootstrap();

2) /home/user/Documentos/Project/laravel-tests/tests/CreatesApplication.php:15    [M] Concat

--- Original
+++ New
@@ @@
      */
     public function createApplication(): Application
     {
-        $app = require __DIR__ . '/../bootstrap/app.php';
+        $app = require '/../bootstrap/app.php' . __DIR__;
         $app->make(Kernel::class)->bootstrap();
         return $app;
     }
 }

3) /home/user/Documentos/Project/laravel-tests/tests/CreatesApplication.php:15    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
      */
     public function createApplication(): Application
     {
-        $app = require __DIR__ . '/../bootstrap/app.php';
+        $app = require '/../bootstrap/app.php';
         $app->make(Kernel::class)->bootstrap();
         return $app;
     }
 }

4) /home/user/Documentos/Project/laravel-tests/tests/CreatesApplication.php:15    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
      */
     public function createApplication(): Application
     {
-        $app = require __DIR__ . '/../bootstrap/app.php';
+        $app = require __DIR__;
         $app->make(Kernel::class)->bootstrap();
         return $app;
     }
 }

5) /home/user/Documentos/Project/laravel-tests/tests/CreatesApplication.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function createApplication(): Application
     {
         $app = require __DIR__ . '/../bootstrap/app.php';
-        $app->make(Kernel::class)->bootstrap();
+        
         return $app;
     }
 }

110) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     use RefreshDatabase;
     #[Test]
-    public function only_logged_in_users_can_see_dashboard_screen(): void
+    protected function only_logged_in_users_can_see_dashboard_screen(): void
     {
         $user = User::factory()->create();
         // Acting as the created user and accessing the dashboard route

111) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:23    [M] DecrementInteger

--- Original
+++ New
@@ @@
         // Acting as the created user and accessing the dashboard route
         $response = $this->actingAs($user)->get(route('dashboard'));
         // Asserting that the status of the response is 200 (OK)
-        $response->assertStatus(200);
+        $response->assertStatus(199);
         // Asserting that the response contains the text 'Dashboard'
         $response->assertSee('Dashboard');
     }

112) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:23    [M] IncrementInteger

--- Original
+++ New
@@ @@
         // Acting as the created user and accessing the dashboard route
         $response = $this->actingAs($user)->get(route('dashboard'));
         // Asserting that the status of the response is 200 (OK)
-        $response->assertStatus(200);
+        $response->assertStatus(201);
         // Asserting that the response contains the text 'Dashboard'
         $response->assertSee('Dashboard');
     }

113) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         // Acting as the created user and accessing the dashboard route
         $response = $this->actingAs($user)->get(route('dashboard'));
-        // Asserting that the status of the response is 200 (OK)
-        $response->assertStatus(200);
+        
         // Asserting that the response contains the text 'Dashboard'
         $response->assertSee('Dashboard');
     }

114) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $response = $this->actingAs($user)->get(route('dashboard'));
         // Asserting that the status of the response is 200 (OK)
         $response->assertStatus(200);
-        // Asserting that the response contains the text 'Dashboard'
-        $response->assertSee('Dashboard');
+        
     }
     #[Test]
     public function non_logged_in_users_cannot_see_dashboard_screen(): void

115) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:29    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertSee('Dashboard');
     }
     #[Test]
-    public function non_logged_in_users_cannot_see_dashboard_screen(): void
+    protected function non_logged_in_users_cannot_see_dashboard_screen(): void
     {
         // Accessing the dashboard route without being authenticated
         $response = $this->get(route('dashboard'));

116) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // Accessing the dashboard route without being authenticated
         $response = $this->get(route('dashboard'));
-        // Asserting that the user is redirected to the login page
-        $response->assertRedirect(route('login'));
+        
     }
     #[Test]
     public function logged_in_user_can_access_dashboard(): void

117) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:39    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertRedirect(route('login'));
     }
     #[Test]
-    public function logged_in_user_can_access_dashboard(): void
+    protected function logged_in_user_can_access_dashboard(): void
     {
         $user = User::factory()->create();
         // Acting as the created user and accessing the dashboard route

118) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:48    [M] DecrementInteger

--- Original
+++ New
@@ @@
         // Acting as the created user and accessing the dashboard route
         $response = $this->actingAs($user)->get(route('dashboard'));
         // Asserting that the status of the response is 200 (OK)
-        $this->assertEquals(200, $response->status(), 'Authenticated user could not access the dashboard.');
+        $this->assertEquals(199, $response->status(), 'Authenticated user could not access the dashboard.');
     }
     #[Test]
     public function ensure_response_content_for_dashboard(): void

119) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:48    [M] IncrementInteger

--- Original
+++ New
@@ @@
         // Acting as the created user and accessing the dashboard route
         $response = $this->actingAs($user)->get(route('dashboard'));
         // Asserting that the status of the response is 200 (OK)
-        $this->assertEquals(200, $response->status(), 'Authenticated user could not access the dashboard.');
+        $this->assertEquals(201, $response->status(), 'Authenticated user could not access the dashboard.');
     }
     #[Test]
     public function ensure_response_content_for_dashboard(): void

120) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         // Acting as the created user and accessing the dashboard route
         $response = $this->actingAs($user)->get(route('dashboard'));
-        // Asserting that the status of the response is 200 (OK)
-        $this->assertEquals(200, $response->status(), 'Authenticated user could not access the dashboard.');
+        
     }
     #[Test]
     public function ensure_response_content_for_dashboard(): void

121) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->assertEquals(200, $response->status(), 'Authenticated user could not access the dashboard.');
     }
     #[Test]
-    public function ensure_response_content_for_dashboard(): void
+    protected function ensure_response_content_for_dashboard(): void
     {
         $user = User::factory()->create();
         // Acting as the created user and accessing the dashboard route

125) /home/user/Documentos/Project/laravel-tests/tests/Feature/DashboardTest.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $response = $this->actingAs($user)->get(route('dashboard'));
         // Asserting that the status of the response is 200 (OK)
         $response->assertStatus(200);
-        // Asserting that the view returned is the 'dashboard' view
-        $response->assertViewIs('dashboard');
+        
     }
 }

126) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     use RefreshDatabase;
     #[Test]
-    public function profile_page_is_displayed(): void
+    protected function profile_page_is_displayed(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('profile.edit'));

127) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:22    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->get(route('profile.edit'));
-        $response->assertOk();
+        
     }
     #[Test]
     public function profile_information_can_be_updated(): void

128) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertOk();
     }
     #[Test]
-    public function profile_information_can_be_updated(): void
+    protected function profile_information_can_be_updated(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => 'test@example.com']);

129) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:31    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function profile_information_can_be_updated(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => 'test@example.com']);
+        $response = $this->actingAs($user)->patch(route('profile.update'), ['email' => 'test@example.com']);
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
         $user->refresh();
         $this->assertSame('Test User', $user->name);

130) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => 'test@example.com']);
-        $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
+        
         $user->refresh();
         $this->assertSame('Test User', $user->name);
         $this->assertSame('test@example.com', $user->email);

131) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => 'test@example.com']);
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
-        $user->refresh();
+        
         $this->assertSame('Test User', $user->name);
         $this->assertSame('test@example.com', $user->email);
         $this->assertNull($user->email_verified_at);

132) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => 'test@example.com']);
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
         $user->refresh();
-        $this->assertSame('Test User', $user->name);
+        
         $this->assertSame('test@example.com', $user->email);
         $this->assertNull($user->email_verified_at);
     }

133) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
         $user->refresh();
         $this->assertSame('Test User', $user->name);
-        $this->assertSame('test@example.com', $user->email);
+        
         $this->assertNull($user->email_verified_at);
     }
     #[Test]

134) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user->refresh();
         $this->assertSame('Test User', $user->name);
         $this->assertSame('test@example.com', $user->email);
-        $this->assertNull($user->email_verified_at);
+        
     }
     #[Test]
     public function email_verification_status_is_unchanged_when_the_email_address_is_unchanged(): void

135) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:46    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->assertNull($user->email_verified_at);
     }
     #[Test]
-    public function email_verification_status_is_unchanged_when_the_email_address_is_unchanged(): void
+    protected function email_verification_status_is_unchanged_when_the_email_address_is_unchanged(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => $user->email]);

136) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function email_verification_status_is_unchanged_when_the_email_address_is_unchanged(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => $user->email]);
+        $response = $this->actingAs($user)->patch(route('profile.update'), ['email' => $user->email]);
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
         $this->assertNotNull($user->refresh()->email_verified_at);
     }

137) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:54    [M] ArrayItem

--- Original
+++ New
@@ @@
     public function email_verification_status_is_unchanged_when_the_email_address_is_unchanged(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => $user->email]);
+        $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' > $user->email]);
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
         $this->assertNotNull($user->refresh()->email_verified_at);
     }

138) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => $user->email]);
-        $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
+        
         $this->assertNotNull($user->refresh()->email_verified_at);
     }
     #[Test]

139) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $response = $this->actingAs($user)->patch(route('profile.update'), ['name' => 'Test User', 'email' => $user->email]);
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
-        $this->assertNotNull($user->refresh()->email_verified_at);
+        
     }
     #[Test]
     public function user_can_delete_their_account(): void

140) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->assertNotNull($user->refresh()->email_verified_at);
     }
     #[Test]
-    public function user_can_delete_their_account(): void
+    protected function user_can_delete_their_account(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->delete(route('profile.destroy'), ['password' => 'password']);

141) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:69    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function user_can_delete_their_account(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->delete(route('profile.destroy'), ['password' => 'password']);
+        $response = $this->actingAs($user)->delete(route('profile.destroy'), []);
         $response->assertSessionHasNoErrors()->assertRedirect(route('welcome'));
         $this->assertGuest();
         $this->assertNull($user->fresh());

142) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:73    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->delete(route('profile.destroy'), ['password' => 'password']);
-        $response->assertSessionHasNoErrors()->assertRedirect(route('welcome'));
+        
         $this->assertGuest();
         $this->assertNull($user->fresh());
     }

143) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:76    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $response = $this->actingAs($user)->delete(route('profile.destroy'), ['password' => 'password']);
         $response->assertSessionHasNoErrors()->assertRedirect(route('welcome'));
-        $this->assertGuest();
+        
         $this->assertNull($user->fresh());
     }
     #[Test]

144) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $response = $this->actingAs($user)->delete(route('profile.destroy'), ['password' => 'password']);
         $response->assertSessionHasNoErrors()->assertRedirect(route('welcome'));
         $this->assertGuest();
-        $this->assertNull($user->fresh());
+        
     }
     #[Test]
     public function correct_password_must_be_provided_to_delete_account(): void

145) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:80    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->assertNull($user->fresh());
     }
     #[Test]
-    public function correct_password_must_be_provided_to_delete_account(): void
+    protected function correct_password_must_be_provided_to_delete_account(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->from(route('profile.edit'))->delete(route('profile.destroy'), ['password' => 'wrong-password']);

146) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:87    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function correct_password_must_be_provided_to_delete_account(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->from(route('profile.edit'))->delete(route('profile.destroy'), ['password' => 'wrong-password']);
+        $response = $this->actingAs($user)->from(route('profile.edit'))->delete(route('profile.destroy'), []);
         $response->assertSessionHasErrorsIn('userDeletion', 'password')->assertRedirect(route('profile.edit'));
         $this->assertNotNull($user->fresh());
     }
 }

147) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:91    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->from(route('profile.edit'))->delete(route('profile.destroy'), ['password' => 'wrong-password']);
-        $response->assertSessionHasErrorsIn('userDeletion', 'password')->assertRedirect(route('profile.edit'));
+        
         $this->assertNotNull($user->fresh());
     }
 }

148) /home/user/Documentos/Project/laravel-tests/tests/Feature/ProfileTest.php:94    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $response = $this->actingAs($user)->from(route('profile.edit'))->delete(route('profile.destroy'), ['password' => 'wrong-password']);
         $response->assertSessionHasErrorsIn('userDeletion', 'password')->assertRedirect(route('profile.edit'));
-        $this->assertNotNull($user->fresh());
+        
     }
 }

149) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:11    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class UserTest extends TestCase
 {
     #[Test]
-    public function check_if_user_columns_are_correct(): void
+    protected function check_if_user_columns_are_correct(): void
     {
         $user = new User();
         // Expected columns

150) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:17    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $user = new User();
         // Expected columns
-        $columns_expected = ['name', 'email', 'password'];
+        $columns_expected = ['email', 'password'];
         // Columns that the User model actually accepts
         $fillable_columns = $user->getFillable();
         // Check if all expected columns are present

151) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:27    [M] Foreach_

--- Original
+++ New
@@ @@
         // Columns that the User model actually accepts
         $fillable_columns = $user->getFillable();
         // Check if all expected columns are present
-        foreach ($columns_expected as $column) {
+        foreach ([] as $column) {
             $this->assertContains($column, $fillable_columns, "The column {$column} is not present.");
         }
         // Check if there are no extra columns

152) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $fillable_columns = $user->getFillable();
         // Check if all expected columns are present
         foreach ($columns_expected as $column) {
-            $this->assertContains($column, $fillable_columns, "The column {$column} is not present.");
+            
         }
         // Check if there are no extra columns
         $extra_columns = array_diff($fillable_columns, $columns_expected);

153) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:32    [M] UnwrapArrayDiff

--- Original
+++ New
@@ @@
             $this->assertContains($column, $fillable_columns, "The column {$column} is not present.");
         }
         // Check if there are no extra columns
-        $extra_columns = array_diff($fillable_columns, $columns_expected);
+        $extra_columns = $fillable_columns;
         $this->assertCount(0, $extra_columns, 'There are extra columns in the model.');
     }
     #[Test]

154) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:33    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         // Check if there are no extra columns
         $extra_columns = array_diff($fillable_columns, $columns_expected);
-        $this->assertCount(0, $extra_columns, 'There are extra columns in the model.');
+        $this->assertCount(-1, $extra_columns, 'There are extra columns in the model.');
     }
     #[Test]
     public function check_if_user_columns_are_not_empty(): void

155) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:33    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         // Check if there are no extra columns
         $extra_columns = array_diff($fillable_columns, $columns_expected);
-        $this->assertCount(0, $extra_columns, 'There are extra columns in the model.');
+        $this->assertCount(1, $extra_columns, 'There are extra columns in the model.');
     }
     #[Test]
     public function check_if_user_columns_are_not_empty(): void

156) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         // Check if there are no extra columns
         $extra_columns = array_diff($fillable_columns, $columns_expected);
-        $this->assertCount(0, $extra_columns, 'There are extra columns in the model.');
+        
     }
     #[Test]
     public function check_if_user_columns_are_not_empty(): void

157) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->assertCount(0, $extra_columns, 'There are extra columns in the model.');
     }
     #[Test]
-    public function check_if_user_columns_are_not_empty(): void
+    protected function check_if_user_columns_are_not_empty(): void
     {
         $user = new User();
         $fillable_columns = $user->getFillable();

158) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = new User();
         $fillable_columns = $user->getFillable();
-        // Check if the fillable columns are not empty
-        $this->assertNotEmpty($fillable_columns, 'The fillable columns should not be empty.');
+        
     }
     #[Test]
     public function check_if_user_columns_include_email_and_password(): void

159) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:47    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->assertNotEmpty($fillable_columns, 'The fillable columns should not be empty.');
     }
     #[Test]
-    public function check_if_user_columns_include_email_and_password(): void
+    protected function check_if_user_columns_include_email_and_password(): void
     {
         $user = new User();
         $fillable_columns = $user->getFillable();

160) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = new User();
         $fillable_columns = $user->getFillable();
-        // Check if the columns include 'email' and 'password'
-        $this->assertContains('email', $fillable_columns, "The column 'email' is not present.");
+        
         $this->assertContains('password', $fillable_columns, "The column 'password' is not present.");
     }
 }

161) /home/user/Documentos/Project/laravel-tests/tests/Unit/UserTest.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $fillable_columns = $user->getFillable();
         // Check if the columns include 'email' and 'password'
         $this->assertContains('email', $fillable_columns, "The column 'email' is not present.");
-        $this->assertContains('password', $fillable_columns, "The column 'password' is not present.");
+        
     }
 }
