64) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:21    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function reset_password_link_screen_can_be_rendered(): void
     {
         $response = $this->get(route('forgot_password.create'));
-        $response->assertStatus(200);
+        $response->assertStatus(201);
     }
     #[Test]
     public function reset_password_link_can_be_requested(): void

65) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:21    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function reset_password_link_screen_can_be_rendered(): void
     {
         $response = $this->get(route('forgot_password.create'));
-        $response->assertStatus(200);
+        
     }
     #[Test]
     public function reset_password_link_can_be_requested(): void

66) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertStatus(200);
     }
     #[Test]
-    public function reset_password_link_can_be_requested(): void
+    protected function reset_password_link_can_be_requested(): void
     {
         Notification::fake();
         $user = User::factory()->create();

67) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     #[Test]
     public function reset_password_link_can_be_requested(): void
     {
-        Notification::fake();
+        
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class);

68) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:31    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         Notification::fake();
         $user = User::factory()->create();
-        $this->post(route('forgot_password.store'), ['email' => $user->email]);
+        $this->post(route('forgot_password.store'), []);
         Notification::assertSentTo($user, ResetPassword::class);
     }
     #[Test]

69) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         Notification::fake();
         $user = User::factory()->create();
-        $this->post(route('forgot_password.store'), ['email' => $user->email]);
+        
         Notification::assertSentTo($user, ResetPassword::class);
     }
     #[Test]

70) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:32    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         Notification::fake();
         $user = User::factory()->create();
-        $this->post(route('forgot_password.store'), ['email' => $user->email]);
+        $this->post(route('forgot_password.store'), ['email' > $user->email]);
         Notification::assertSentTo($user, ResetPassword::class);
     }
     #[Test]

71) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Notification::fake();
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
-        Notification::assertSentTo($user, ResetPassword::class);
+        
     }
     #[Test]
     public function reset_password_screen_can_be_rendered(): void

72) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Notification::assertSentTo($user, ResetPassword::class);
     }
     #[Test]
-    public function reset_password_screen_can_be_rendered(): void
+    protected function reset_password_screen_can_be_rendered(): void
     {
         Notification::fake();
         $user = User::factory()->create();

77) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Notification::fake();
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
-        Notification::assertSentTo($user, ResetPassword::class, function ($notification) {
-            $response = $this->get(route('reset_password.create', ['token' => $notification->token]));
-            $response->assertStatus(200);
-            return true;
-        });
+        
     }
     #[Test]
     public function password_can_be_reset_with_valid_token(): void

78) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:50    [M] ArrayItem

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) {
-            $response = $this->get(route('reset_password.create', ['token' => $notification->token]));
+            $response = $this->get(route('reset_password.create', ['token' > $notification->token]));
             $response->assertStatus(200);
             return true;
         });

79) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:50    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) {
-            $response = $this->get(route('reset_password.create', ['token' => $notification->token]));
+            $response = $this->get(route('reset_password.create', []));
             $response->assertStatus(200);
             return true;
         });

80) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:52    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) {
             $response = $this->get(route('reset_password.create', ['token' => $notification->token]));
-            $response->assertStatus(200);
+            $response->assertStatus(199);
             return true;
         });
     }

81) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:52    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) {
             $response = $this->get(route('reset_password.create', ['token' => $notification->token]));
-            $response->assertStatus(200);
+            $response->assertStatus(201);
             return true;
         });
     }

82) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) {
             $response = $this->get(route('reset_password.create', ['token' => $notification->token]));
-            $response->assertStatus(200);
+            
             return true;
         });
     }

83) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:54    [M] TrueValue

--- Original
+++ New
@@ @@
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) {
             $response = $this->get(route('reset_password.create', ['token' => $notification->token]));
             $response->assertStatus(200);
-            return true;
+            return false;
         });
     }
     #[Test]

84) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:58    [M] PublicVisibility

--- Original
+++ New
@@ @@
         });
     }
     #[Test]
-    public function password_can_be_reset_with_valid_token(): void
+    protected function password_can_be_reset_with_valid_token(): void
     {
         Notification::fake();
         $user = User::factory()->create();

89) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Notification::fake();
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
-        Notification::assertSentTo($user, ResetPassword::class, function ($notification) use ($user) {
-            $response = $this->post(route('reset_password.store'), ['token' => $notification->token, 'email' => $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
-            $response->assertSessionHasNoErrors()->assertRedirect(route('login'));
-            return true;
-        });
+        
     }
 }

90) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:70    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) use ($user) {
-            $response = $this->post(route('reset_password.store'), ['token' => $notification->token, 'email' => $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
+            $response = $this->post(route('reset_password.store'), ['email' => $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
             $response->assertSessionHasNoErrors()->assertRedirect(route('login'));
             return true;
         });
     }
 }

91) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:71    [M] ArrayItem

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) use ($user) {
-            $response = $this->post(route('reset_password.store'), ['token' => $notification->token, 'email' => $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
+            $response = $this->post(route('reset_password.store'), ['token' > $notification->token, 'email' => $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
             $response->assertSessionHasNoErrors()->assertRedirect(route('login'));
             return true;
         });
     }
 }

92) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:72    [M] ArrayItem

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) use ($user) {
-            $response = $this->post(route('reset_password.store'), ['token' => $notification->token, 'email' => $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
+            $response = $this->post(route('reset_password.store'), ['token' => $notification->token, 'email' > $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
             $response->assertSessionHasNoErrors()->assertRedirect(route('login'));
             return true;
         });
     }
 }

93) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $this->post(route('forgot_password.store'), ['email' => $user->email]);
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) use ($user) {
             $response = $this->post(route('reset_password.store'), ['token' => $notification->token, 'email' => $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
-            $response->assertSessionHasNoErrors()->assertRedirect(route('login'));
+            
             return true;
         });
     }
 }

94) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordResetTest.php:80    [M] TrueValue

--- Original
+++ New
@@ @@
         Notification::assertSentTo($user, ResetPassword::class, function ($notification) use ($user) {
             $response = $this->post(route('reset_password.store'), ['token' => $notification->token, 'email' => $user->email, 'password' => 'password', 'password_confirmation' => 'password']);
             $response->assertSessionHasNoErrors()->assertRedirect(route('login'));
-            return true;
+            return false;
         });
     }
 }

95) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordUpdateTest.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     use RefreshDatabase;
     #[Test]
-    public function password_can_be_updated(): void
+    protected function password_can_be_updated(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['current_password' => 'password', 'password' => 'new-password', 'password_confirmation' => 'new-password']);

96) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordUpdateTest.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function password_can_be_updated(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['current_password' => 'password', 'password' => 'new-password', 'password_confirmation' => 'new-password']);
+        $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['password' => 'new-password', 'password_confirmation' => 'new-password']);
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
         $this->assertTrue(Hash::check('new-password', $user->refresh()->password));
     }

97) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordUpdateTest.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['current_password' => 'password', 'password' => 'new-password', 'password_confirmation' => 'new-password']);
-        $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
+        
         $this->assertTrue(Hash::check('new-password', $user->refresh()->password));
     }
     #[Test]

98) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordUpdateTest.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = User::factory()->create();
         $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['current_password' => 'password', 'password' => 'new-password', 'password_confirmation' => 'new-password']);
         $response->assertSessionHasNoErrors()->assertRedirect(route('profile.edit'));
-        $this->assertTrue(Hash::check('new-password', $user->refresh()->password));
+        
     }
     #[Test]
     public function correct_password_must_be_provided_to_update_password(): void

99) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordUpdateTest.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->assertTrue(Hash::check('new-password', $user->refresh()->password));
     }
     #[Test]
-    public function correct_password_must_be_provided_to_update_password(): void
+    protected function correct_password_must_be_provided_to_update_password(): void
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['current_password' => 'wrong-password', 'password' => 'new-password', 'password_confirmation' => 'new-password']);

100) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordUpdateTest.php:41    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function correct_password_must_be_provided_to_update_password(): void
     {
         $user = User::factory()->create();
-        $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['current_password' => 'wrong-password', 'password' => 'new-password', 'password_confirmation' => 'new-password']);
+        $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['password' => 'new-password', 'password_confirmation' => 'new-password']);
         $response->assertSessionHasErrorsIn('updatePassword', 'current_password')->assertRedirect(route('profile.edit'));
     }
 }

101) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/PasswordUpdateTest.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $user = User::factory()->create();
         $response = $this->actingAs($user)->from(route('profile.edit'))->put(route('password.update'), ['current_password' => 'wrong-password', 'password' => 'new-password', 'password_confirmation' => 'new-password']);
-        $response->assertSessionHasErrorsIn('updatePassword', 'current_password')->assertRedirect(route('profile.edit'));
+        
     }
 }

102) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/RegistrationTest.php:14    [M] PublicVisibility

--- Original
+++ New
@@ @@
 {
     use RefreshDatabase;
     #[Test]
-    public function registration_screen_can_be_rendered(): void
+    protected function registration_screen_can_be_rendered(): void
     {
         $response = $this->get(route('register'));
         $response->assertStatus(200);

103) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/RegistrationTest.php:19    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function registration_screen_can_be_rendered(): void
     {
         $response = $this->get(route('register'));
-        $response->assertStatus(200);
+        $response->assertStatus(199);
     }
     #[Test]
     public function new_users_can_register(): void

104) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/RegistrationTest.php:19    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function registration_screen_can_be_rendered(): void
     {
         $response = $this->get(route('register'));
-        $response->assertStatus(200);
+        $response->assertStatus(201);
     }
     #[Test]
     public function new_users_can_register(): void

105) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/RegistrationTest.php:19    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function registration_screen_can_be_rendered(): void
     {
         $response = $this->get(route('register'));
-        $response->assertStatus(200);
+        
     }
     #[Test]
     public function new_users_can_register(): void

106) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/RegistrationTest.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response->assertStatus(200);
     }
     #[Test]
-    public function new_users_can_register(): void
+    protected function new_users_can_register(): void
     {
         $response = $this->post(route('register.store'), ['name' => 'Test User', 'email' => 'test@example.com', 'password' => 'password', 'password_confirmation' => 'password']);
         $this->assertAuthenticated();

107) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/RegistrationTest.php:25    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     #[Test]
     public function new_users_can_register(): void
     {
-        $response = $this->post(route('register.store'), ['name' => 'Test User', 'email' => 'test@example.com', 'password' => 'password', 'password_confirmation' => 'password']);
+        $response = $this->post(route('register.store'), ['email' => 'test@example.com', 'password' => 'password', 'password_confirmation' => 'password']);
         $this->assertAuthenticated();
         $response->assertRedirect(RouteServiceProvider::HOME);
     }
 }

108) /home/user/Documentos/Project/laravel-tests/tests/Feature/Auth/RegistrationTest.php:32    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function new_users_can_register(): void
     {
         $response = $this->post(route('register.store'), ['name' => 'Test User', 'email' => 'test@example.com', 'password' => 'password', 'password_confirmation' => 'password']);
-        $this->assertAuthenticated();
+        
         $response->assertRedirect(RouteServiceProvider::HOME);
     }
 }
